//PersistentObj
//保持对象在场景跳转时依然存在

using UnityEngine;
using System.Collections;

public class PersistentObj : MonoBehaviour 
{
    //--------------------------------变量定义部分---------------------------------


    //-----------------------------------------【Start()函数】---------------------------------------------
    // 说明：此函数仅在Update函数第一次被调用前被调用，常用于进行数据的初始化  
    //--------------------------------------------------------------------------------------------------------  
	void Start ()
	{
        //使当前挂载了此脚本的对象在新场景载入时不被销毁
		DontDestroyOnLoad(gameObject);
	}
}
